doc/design.org

* Specs (Sequential Processes and Entity Component System)

  Specs is a game scripting framework.  It's not a game engine, but a
  set of abstractions enabling organization of games into
  entity-component systems.

* Entity-Component System
  
  The entity-component-system(ECS) architecture is a means of
  organizing objects throug "composition over inheritance".

  Rather than defining game entities as classes of objects with
  pre-defined type hierarchies and fields, game entities are
  represented as collections of components.

  In Specs, each entity is identified by a UUID, and each component is
  identified by a component type.  A component type may be a proper
  class tag/data type, or it may be any keyword or symbol in an
  object's type metadata.

  Specs terminology for an Entity's UUID is *eid*, and a Component Type
  is *ctype*.

  Each entity has at most one of any single component type, such that [
  
  Systems are functions which execute on entities and update their
  components as necessary.

* Communicating Sequential Processes

  Communicating sequential processes are asynchronous processes which
  can wait on input/output over channels.  These enable the writing of
  asynchronous flows of control without resorting to callbacks.

* SPECS Core Concepts

** The cross-map data structure

   While Entities in the ECS architecture can often be seen as
   collections of components, that is not entirely true for Specs.  In
   Specs, the game state is stored as a two-dimensional map, where
   Entity ID's are the rows and Component Types are the columns.

   Entries into the cross-map have keys of the form [eid, ctype], and
   their values are components.  However, the cross-map structure
   enables views of entire rows and columns as single maps, so both
   the table and the collection view of entities are valid in this
   case.

   Note on terminology of rows and columns:
   - e-map :: A single row of the table corresponding to one eid
   - c-map :: A single column of the table corresponding to one ctype
   - ec-entry :: A single cell in the table, identified by an
                 [eid,ctype] pair.
   - ec-seq :: A list of ec-entries.

   The ::dtype key in metadata encodes one of the types listed above.

** Profiles

   A component profile is a set of component types required for some
   action.  Typically, this action is the application of a system
   function.

   Given a cross-map with Entity ID's as rows and Component Types as
   columns, a component profile is the set of all rows which have all
   of the specified components.

   There are several functions that construct iteration specifications
   (profiles) for the cross map.  They are shown in the table below,
   along with details about their use.
   
   | Profile      | Keys for       | Input    | Output          | Cross-iteration        |
   | Type         | Profile        | Type     | Type            |                        |
   |--------------+----------------+----------+-----------------+------------------------|
   | match-ctype* | ctype          | e-map    | e-map or ec-seq | each row with all cols |
   | match-eid    | eid            | c-map    | c-map or ec-seq | each col with all rows |
   | for-ctype    | ctype          | c-map    | c-map or ec-seq | each requested col     |
   | for-eid      | eid            | e-map    | e-map or ec-seq | each requested row     |
   | for-entry**  | other profiles | ec-entry | ec-seq          | all matching entries   |

   * Match-ctype is the default profile type.  If only a seq is
     provided as a profile, it is assumed to be for match-ctype.
     
   ** For-entry allows the composition of other profile types to create
      a profile that allows iteration over single entries in the
      cross-map. Note that this is not normal function composition.
      That won't work well on these profiles.

** System Functions

   A system function allows the updating of entries in the
   entity/component map.  A system function is defined in terms of a
   component profile and a function from Entity -> list of
   [ID,Type]->Component pairs.  The system is applied to each entity
   in its profile, and each of the new entries it returnes is
   associated into the cross-map.  Note that map updates are not made
   visible until the current system stops executing.

   Note that system functions will have match-ctype profiles by
   default, and the "defsys" macro only supports match-ctype profiles.
   
   See examples.org for extended examples of system functions.

** Controllers

   Controllers are Communicating Sequential Processes that control and
   react to the game state.  While system functions are executed
   synchronously durung game update cycles, controllers run completely
   independent of that cycle.

   Controllers may observe and effect changes in the game state by
   passing or receiving messages (described below).  Messages are not
   applied to the game state instantly, but are queued and applied
   either before or after the system functions on each update cycle.

   Note: The caller may specify if they want a control message to be
   executed before or after the system functions.  This is known as
   the "position" of the control message, and may be either ~:head~
   (before system functions) or ~:tail~ (after system functions).

** Messages
   
   Messages are any type of data sent over a channel from a controller
   to the game state, game state to controller, or between separate
   controllers.

