doc/design.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>design</title>
<!-- 2016-05-14 Sat 16:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">design</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Specs (Sequential Processes and Entity Component System)</a></li>
<li><a href="#sec-2">2. Entity-Component System</a></li>
<li><a href="#sec-3">3. Communicating Sequential Processes</a></li>
<li><a href="#sec-4">4. SPECS Core Concepts</a>
<ul>
<li><a href="#sec-4-1">4.1. The cross-map data structure</a></li>
<li><a href="#sec-4-2">4.2. Profiles</a></li>
<li><a href="#sec-4-3">4.3. System Functions</a></li>
<li><a href="#sec-4-4">4.4. Controllers</a></li>
<li><a href="#sec-4-5">4.5. Messages</a></li>
<li><a href="#sec-4-6">4.6. Control Messages</a></li>
<li><a href="#sec-4-7">4.7. Data Coercion</a></li>
<li><a href="#sec-4-8">4.8. </a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Specs (Sequential Processes and Entity Component System)</h2>
<div class="outline-text-2" id="text-1">
<p>
Specs is a game scripting framework.  It's not a game engine, but a
set of abstractions enabling organization of games into
entity-component systems.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Entity-Component System</h2>
<div class="outline-text-2" id="text-2">
<p>
The entity-component-system(ECS) architecture is a means of
organizing objects throug "composition over inheritance".
</p>

<p>
Rather than defining game entities as classes of objects with
pre-defined type hierarchies and fields, game entities are
represented as collections of components.
</p>

<p>
In Specs, each entity is identified by a UUID, and each component is
identified by a component type.  A component type may be a proper
class tag/data type, or it may be any keyword or symbol in an
object's type metadata.
</p>

<p>
Specs terminology for an Entity's UUID is <b>eid</b>, and a Component Type
is <b>ctype</b>.
</p>

<p>
Each entity has at most one of any single component type, such that [
</p>

<p>
Systems are functions which execute on entities and update their
components as necessary.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Communicating Sequential Processes</h2>
<div class="outline-text-2" id="text-3">
<p>
Communicating sequential processes are asynchronous processes which
can wait on input/output over channels.  These enable the writing of
asynchronous flows of control without resorting to callbacks.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> SPECS Core Concepts</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> The cross-map data structure</h3>
<div class="outline-text-3" id="text-4-1">
<p>
While Entities in the ECS architecture can often be seen as
collections of components, that is not entirely true for Specs.  In
Specs, the game state is stored as a two-dimensional map, where
Entity ID's are the rows and Component Types are the columns.
</p>

<p>
Entries into the cross-map have keys of the form [eid, ctype], and
their values are components.  However, the cross-map structure
enables views of entire rows and columns as single maps, so both
the table and the collection view of entities are valid in this
case.
</p>

<p>
Note on terminology of rows and columns:
</p>
<dl class="org-dl">
<dt> e-map </dt><dd>A single row of the table corresponding to one eid
</dd>
<dt> c-map </dt><dd>A single column of the table corresponding to one ctype
</dd>
<dt> ec-entry </dt><dd>A single cell in the table, identified by an
[eid,ctype] pair.
</dd>
<dt> ec-seq </dt><dd>A list of ec-entries.
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Profiles</h3>
<div class="outline-text-3" id="text-4-2">
<p>
A component profile is a set of component types required for some
action.  Typically, this action is the application of a system
function.
</p>

<p>
Given a cross-map with Entity ID's as rows and Component Types as
columns, a component profile is the set of all rows which have all
of the specified components.
</p>

<p>
There are several functions that construct iteration specifications
(profiles) for the cross map.  They are shown in the table below,
along with details about their use.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Profile</th>
<th scope="col" class="left">Keys for</th>
<th scope="col" class="left">Input</th>
<th scope="col" class="left">Output</th>
<th scope="col" class="left">Cross-iteration</th>
</tr>

<tr>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Profile</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">match-ctype*</td>
<td class="left">ctype</td>
<td class="left">e-map</td>
<td class="left">e-map or ec-seq</td>
<td class="left">each row with all cols</td>
</tr>

<tr>
<td class="left">match-eid</td>
<td class="left">eid</td>
<td class="left">c-map</td>
<td class="left">c-map or ec-seq</td>
<td class="left">each col with all rows</td>
</tr>

<tr>
<td class="left">for-ctype</td>
<td class="left">ctype</td>
<td class="left">c-map</td>
<td class="left">c-map or ec-seq</td>
<td class="left">each requested col</td>
</tr>

<tr>
<td class="left">for-eid</td>
<td class="left">eid</td>
<td class="left">e-map</td>
<td class="left">e-map or ec-seq</td>
<td class="left">each requested row</td>
</tr>

<tr>
<td class="left">for-entry**</td>
<td class="left">other profiles</td>
<td class="left">ec-entry</td>
<td class="left">ec-seq</td>
<td class="left">all matching entries</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Match-ctype is the default profile type.  If only a seq is
provided as a profile, it is assumed to be for match-ctype.
</li>
</ul>

<p>
** For-entry allows the composition of other profile types to create
   a profile that allows iteration over single entries in the
   cross-map. Note that this is not normal function composition.
   That won't work well on these profiles.
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> System Functions</h3>
<div class="outline-text-3" id="text-4-3">
<p>
A system function allows the updating of entries in the
entity/component map.  A system function is defined in terms of a
component profile and a function from Entity -&gt; list of
[ID,Type]-&gt;Component pairs.  The system is applied to each entity
in its profile, and each of the new entries it returnes is
associated into the cross-map.  Note that map updates are not made
visible until the current system stops executing.
</p>

<p>
Note that system functions will have match-ctype profiles by
default, and the "defsys" macro only supports match-ctype profiles.
</p>

<p>
See examples.org for extended examples of system functions.
</p>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Controllers</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Controllers are Communicating Sequential Processes that control and
react to the game state.  While system functions are executed
synchronously durung game update cycles, controllers run completely
independent of that cycle.
</p>

<p>
Controllers may observe and effect changes in the game state by
passing or receiving messages (described below).  Messages are not
applied to the game state instantly, but are queued and applied
either before or after the system functions on each update cycle.
</p>

<p>
Note: The caller may specify if they want a control message to be
executed before or after the system functions.  This is known as
the "position" of the control message, and may be either <code>:head</code>
(before system functions) or <code>:tail</code> (after system functions).
</p>
</div>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Messages</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Messages are any type of data sent over a channel from a controller
to the game state, game state to controller, or between separate
controllers.
</p>
</div>
</div>
