doc/design.org
** System Messages

   System messages are a special type of message that can only be
   sent from controllers to the game state.

   These messages consist of a function very similar to a system
   function.  In fact, a system message *is* a system function.  The
   only difference is that system messages are sent over a channel,
   and the output of the function is returned over the channel.

   Keep in mind that channels may be equipped with transducers to
   modify the input/output.  As is described below in the Data
   Coercion section, all system functions end up outputting an
   ec-seq.  These ec-seqs will be the input to any transducers on the
   receiving channel.

** The Control State
   n
   The control state consists of the following parts:
   
   - Cross-map of entity-component pairs
   - Control channel
   - 

** Control Messages
   

