doc/design.html

<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Control Messages</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Control messages are a special type of message that can only be
sent from controllers to the game state.
</p>

<p>
These messages consist of a function very similar to a system
function.  In fact, a control message <b>is</b> a system function.  The
only difference is that control messages are sent over a channel,
and theoutput of the function is returned over the channel.
</p>

<p>
Keep in mind that channels may be equipped with transducers to
modify the input/output.  As is described below in the Data
Coercion section, all system functions end up outputting an
ec-seq.  These ec-seqs will be the input to any transducers on the
receiving channel.
</p>
</div>
</div>
