doc/design.org
** Data Coercion 
   
   As the profile type chart suggests in the Component Profiles
   section, a function of any profile type may have an ec-seq as its
   output.

   In fact, fundamentally, ec-seq is ultimately the return type of all
   systems.  Therefore, any data output by a system function
   (including control messages) must be coerced into an ec-seq.  This
   is done through the use of a set of dynamic global variables
   referred to collectively as the *coercion context*.

   Here is a description of the coerction context variables:

   - ~*profile*~ :: The component profile that is currently being used
                    for iteration.  This will match the component
                    profile of the system function currently being
                    executed.
   - ~*eid*~ :: The ID of the entity currently being accessed.  This
                variable is only set in system functions that take
                *e-maps* or *ec-entries* as input.  Otherwise, it is
                nil.
   - ~*ctype*~ :: The type of the component currently being accessed.
                  This variable is only set in system functions that
                  take *c-maps* or *ec-entries* as input.  Otherwise,
                  it is nil.
   - ~*state*~ :: The game state on which the current state function
                  is operating.  Note that the game state is only
                  updated after a system function has applied to *all*
                  valid elements.  Therefore, this state will *not*
                  reflect earlier changes made by the same system
                  function during the current update cycle.
   - ~*controller*~ :: If the current system function is a control
                       message, this is the controller that sent that
                       control message.  Nil otherwise.
   - ~*dt*~ :: If this system function was called during an update
               cycle, this represents the time difference between the
               start of the last update cycle and the start of the
               current update cycle.  The value is a double, and
               represents the number of seconds (usually, this will be
               much smaller than 1.0).
   - ~*position*~ :: Either ~::head~, ~::body~, or ~::tail~.  If the
                     current system function is a control message,
                     indicates if that system is executing before or
                     after the synchronous system functions.  If it is
                     a synchronous update function, the value is
                     ~::body~.
                     Nil otherwise.
                       

   TODO: Maybe some of the above should be in a different context?

   Here is a chart describing the coercion process for different data
   types:

   | Data type           | Conversion                                      | Valid for    | Valid for    | Valid for       |
   |                     | logic                                           | e-map input? | c-map input? | ec-entry input? |
   |---------------------+-------------------------------------------------+--------------+--------------+-----------------|
   | e-map*              | Map destructures to ctype->component            |              |              |                 |
   |                     | entries.  These are changed to                  | OK           |              |                 |
   |                     | [~*eid*~ ctype]->component entries.             |              |              |                 |
   |---------------------+-------------------------------------------------+--------------+--------------+-----------------|
   | c-map*              | Map destructures to eid->component              |              |              |                 |
   |                     | entries.  These are changed to                  |              | OK           |                 |
   |                     | [eid ~*ctype*~]->component entries.             |              |              |                 |
   |---------------------+-------------------------------------------------+--------------+--------------+-----------------|
   | ec-seq              | Left as it is.                                  | OK           | OK           | OK              |
   |---------------------+-------------------------------------------------+--------------+--------------+-----------------|
   | ec-entry            | Added to a one-element ec-seq.                  |              |              | OK              |
   |---------------------+-------------------------------------------------+--------------+--------------+-----------------|
   | [eid e-map]         | This represents a new row.  Every pair          |              |              |                 |
   |                     | of type ctype->component in the e-map           | OK           |              |                 |
   |                     | will be changed to a pair with the              |              |              |                 |
   |                     | provided eid as the first index.                |              |              |                 |
   |---------------------+-------------------------------------------------+--------------+--------------+-----------------|
   | [ctype c-map]       | Same as above, but eid->component pairs         |              |              |                 |
   |                     | in the map are get the provided ctype           |              | OK           |                 |
   |                     | as the second element of their key.             |              |              |                 |
   |---------------------+-------------------------------------------------+--------------+--------------+-----------------|
   | [eid other]         | Transforms into ~[ [eid *ctype*] other ]~.      | OK           |              |                 |
   |---------------------+-------------------------------------------------+--------------+--------------+-----------------|
   | [ctype other]       | Transforms into ~[ [*eid* ctype] other ]~.      |              | OK           |                 |
   |                     |                                                 |              |              |                 |
   |---------------------+-------------------------------------------------+--------------+--------------+-----------------|
   | [eid nil]           | Special case - Dissociates entire eid row.      | OK           |              |                 |
   |                     |                                                 |              |              |                 |
   |---------------------+-------------------------------------------------+--------------+--------------+-----------------|
   | [ctype nil]         | Special case - Dissociates entire ctype col.    |              | OK           |                 |
   |                     |                                                 |              |              |                 |
   |---------------------+-------------------------------------------------+--------------+--------------+-----------------|
   | [ [eid nil] nil ]   | Special case - Dissociates entire eid row       | OK           |              | OK              |
   |                     |                                                 |              |              |                 |
   |---------------------+-------------------------------------------------+--------------+--------------+-----------------|
   | [ [nil ctype] nil ] | Special case - Dissociates entire ctype col.    |              | OK           | OK              |
   |---------------------+-------------------------------------------------+--------------+--------------+-----------------|
   | other               | All other object types are assumed to be        |              |              |                 |
   |                     | components.  They will be turned into entries   | OK           |              | OK              |
   |                     | of ~[ [ *id* (type other) ] other ]~.           |              |              |                 |
   |                     |                                                 |              |              |                 |
   |                     | An object's type is assumed to correspond       |              |              |                 |
   |                     | to its component-type.  The clojure function    |              |              |                 |
   |                     | "type" will first check for :type metadata,     |              |              |                 |
   |                     | and if not present, will return the object's    |              |              |                 |
   |                     | class.  For this reason, it is suggested that   |              |              |                 |
   |                     | user-defined component types or imeta instances |              |              |                 |
   |                     | be used for component values.                   |              |              |                 |
   
   TODO: Maybe the nil should be replaced by a special removal type...?

   *Note: e-map and c-map are not just any map type.  They must
   have ~:e-map->true~ or ~:c-map->true~ in their metadata to be
   considered as such.  Update operations on input maps or use
   of the c-map or e-map functions will ensure that this metadata is
   present.

