doc/design.html



<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> Data Coercion</h3>
<div class="outline-text-3" id="text-4-7">
<p>
As the profile type chart suggests in the Component Profiles
section, a function of any profile type may have an ec-seq as its
output.
</p>

<p>
In fact, fundamentally, ec-seq is ultimately the return type of all
systems.  Therefore, any data output by a system function
(including control messages) must be coerced into an ec-seq.  This
is done through the use of a set of dynamic global variables
referred to collectively as the <b>coercion context</b>.
</p>

<p>
Here is a description of the coerction context variables:
</p>

<dl class="org-dl">
<dt> <code>*profile*</code> </dt><dd>The component profile that is currently being used
for iteration.  This will match the component
profile of the system function currently being
executed.
</dd>
<dt> <code>*eid*</code> </dt><dd>The ID of the entity currently being accessed.  This
variable is only set in system functions that take
<b>e-maps</b> or <b>ec-entries</b> as input.  Otherwise, it is
nil.
</dd>
<dt> <code>*ctype*</code> </dt><dd>The type of the component currently being accessed.
This variable is only set in system functions that
take <b>c-maps</b> or <b>ec-entries</b> as input.  Otherwise,
it is nil.
</dd>
<dt> <code>*state*</code> </dt><dd>The game state on which the current state function
is operating.  Note that the game state is only
updated after a system function has applied to <b>all</b>
valid elements.  Therefore, this state will <b>not</b>
reflect earlier changes made by the same system
function during the current update cycle.
</dd>
<dt> <code>*controller*</code> </dt><dd>If the current system function is a control
message, this is the controller that sent that
control message.  Nil otherwise.
</dd>
<dt> <code>*dt*</code> </dt><dd>If this system function was called during an update
cycle, this represents the time difference between the
start of the last update cycle and the start of the
current update cycle.  The value is a double, and
represents the number of seconds (usually, this will be
much smaller than 1.0).
</dd>
<dt> <code>*position*</code> </dt><dd>Either <code>:head</code> or <code>:tail</code>.  If the current system
function is a control message, indicates if that
system is executing before or after the
synchronous system functions.  Nil otherwise.
</dd>
</dl>


<p>
TODO: Maybe some of the above should be in a different context?
</p>

<p>
Here is a chart describing the coercion process for different data
types:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Data type</th>
<th scope="col" class="left">Conversion</th>
<th scope="col" class="left">Valid for</th>
<th scope="col" class="left">Valid for</th>
<th scope="col" class="left">Valid for</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">logic</th>
<th scope="col" class="left">e-map input?</th>
<th scope="col" class="left">c-map input?</th>
<th scope="col" class="left">ec-entry input?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">e-map*</td>
<td class="left">Map destructures to ctype-&gt;component</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">entries.  These are changed to</td>
<td class="left">OK</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">[~*eid*~ ctype]-&gt;component entries.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">c-map*</td>
<td class="left">Map destructures to eid-&gt;component</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">entries.  These are changed to</td>
<td class="left">&#xa0;</td>
<td class="left">OK</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">[eid ~*ctype*~]-&gt;component entries.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">ec-seq</td>
<td class="left">Left as it is.</td>
<td class="left">OK</td>
<td class="left">OK</td>
<td class="left">OK</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">ec-entry</td>
<td class="left">Added to a one-element ec-seq.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">OK</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">[eid e-map]</td>
<td class="left">This represents a new row.  Every pair</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">of type ctype-&gt;component in the e-map</td>
<td class="left">OK</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">will be changed to a pair with the</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">provided eid as the first index.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">[ctype c-map]</td>
<td class="left">Same as above, but eid-&gt;component pairs</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">in the map are get the provided ctype</td>
<td class="left">&#xa0;</td>
<td class="left">OK</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">as the second element of their key.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">[eid other]</td>
<td class="left">Transforms into <code>[ [eid *ctype*] other ]</code>.</td>
<td class="left">OK</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">[ctype other]</td>
<td class="left">Transforms into <code>[ [*eid* ctype] other ]</code>.</td>
<td class="left">&#xa0;</td>
<td class="left">OK</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">other</td>
<td class="left">All other object types are assumed to be</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">components.  They will be turned into entries</td>
<td class="left">OK</td>
<td class="left">&#xa0;</td>
<td class="left">OK</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">of <code>[ [ *id* (type other) ] other ]</code>.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">An object's type is assumed to correspond</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">to its component-type.  The clojure function</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">"type" will first check for :type metadata,</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">and if not present, will return the object's</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">class.  For this reason, it is suggested that</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">user-defined component types or imeta instances</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">be used for component values.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
*Note: e-map and c-map are not just any map type.  They must
have <code>:e-map-&gt;true</code> or <code>:c-map-&gt;true</code> in their metadata to be
considered as such.  Update operations on input maps or use
of the c-map or e-map functions will ensure that this metadata is
present.
</p>
</div>
</div>

<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> </h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-05-14 Sat 16:50</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.0.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
